app/views/blogs/index.html.erb

SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
			<%= blog.picture %><br/>
			<%= blog.publication_date %>, par <%= blog.author.first_name %> <%= blog.author.last_name %>