app/views/blogs/show.html.erb

SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
<p><%= @blog.body %></p><br/>
<p>écrit par <%= @blog.author.first_name %> <%= @blog.author.last_name %></p>